app/controllers/matchings_controller.rb

	def create
		@matching = Matching.new(matching_params)
		#Detect the face
		if @matching.save
---
INSERT INTO `matchings` (`created_at`, `updated_at`, `image_uid`) VALUES ('2016-12-16 21:44:10', '2016-12-16 21:44:10', '2016/12/16/5xtns6bnra_images.duckduckgo.com.png')