app/controllers/vips_controller.rb

  def index
    @vips = Vip.all
---
SELECT `vips`.* FROM `vips`

  def create
    @vip = Vip.new(vip_params)

    #BEFORE GETTING persistedFaceId
    if @vip.save
---
INSERT INTO `vips` (`img_name`, `img_type`, `img_data`, `size`, `created_at`, `updated_at`, `image_uid`) VALUES ('matching[image]', 'image/png', x'2e2e2e', 6, '2016-12-16 21:48:25', '2016-12-16 21:48:25', '2016/12/16/823vxgkrzt_file')

  def destroy
    @vip.destroy
---
DELETE FROM `vips` WHERE `vips`.`id` = 980190962

    def set_vip
      @vip = Vip.find(params[:id])
---
SELECT  `vips`.* FROM `vips` WHERE `vips`.`id` = 980190962 LIMIT 1